{"home":{"photos":[{"name":"home1496900237430.jpg","path":"uploads/home1496900237430.jpg"},{"name":"home1496900239836.jpg","path":"uploads/home1496900239836.jpg"},{"name":"home1496900240672.jpg","path":"uploads/home1496900240672.jpg"},{"name":"home1496900241149.jpg","path":"uploads/home1496900241149.jpg"},{"name":"home1496900240462.jpg","path":"uploads/home1496900240462.jpg"},{"name":"home1496900241079.jpg","path":"uploads/home1496900241079.jpg"},{"name":"home1496900241209.jpg","path":"uploads/home1496900241209.jpg"},{"name":"home1496900240756.jpg","path":"uploads/home1496900240756.jpg"},{"name":"home1496900240784.jpg","path":"uploads/home1496900240784.jpg"},{"name":"home1496900240583.jpg","path":"uploads/home1496900240583.jpg"},{"name":"home1496900240883.jpg","path":"uploads/home1496900240883.jpg"},{"name":"home1496900241057.jpg","path":"uploads/home1496900241057.jpg"}]},"about":[{"class":"italic","text":"'The journey from inspiration to realisation inspires me.'"},{"class":"normal","text":"After graduating from Wellington School of Design with a Victoria University Degree in Industrial Design Richard travels to Europe. Here he lives on a boat with and works for the Dutch artist, stone sculptor Bastian De Gross, who teaches him the art in form finding, letting materials do the talking, and the natural flow of lines. This starts a journey of discovery and learning in creation and design."},{"class":"normal","text":"This journey quickly becomes a roller coaster ride, which sees him travelling around the globe contracting to European and American brands, mostly in sporting products and apparel. The intersection between sportswear and lifestyle wear and accessories becomes the niche that fascinates him the most. Fischer, Red Bull International, and Riggler are companies he's lent his skills to."},{"class":"normal","text":"Currently living in New Zealand Richard has found his skills have been adopted by the hospitality sector and has become heavily involved in fit outs and furniture design. Like many designers these days he works across a wide range of disciplines. He still has ties to sportswear, but also works with graphics and branding, which has included animations that have been screened globally across various public platforms for Wagamama International."},{"class":"normal","text":"As his business has grown Richard now builds up teams of designers and manufactures to complete jobs."},{"class":"italic","text":"'The journey from inspiration to realisation inspires me. Every time I put pen to paper I'm searching for unique solutions that I feel will excite people and contribute culturally in some form. My designs are intended to improve the performance of a clients business and also empower the individuals who interact with them.'"}],"projects":[{"title":"Matterhorn","description":"The design for The Matterhorn's foray into the Auckland hospitality scene was dark, moody, and influenced by a mix of luxury Swiss Chalets and urban street vernacular. Like a great cover song, the message of the original Wellington Matterhorn remained but was presented in a new way. The design was well received by media and was immediately included in Metro Magazine's Top 50 Restaurants list.","photos":[{"name":"Matterhorn1498376403940.jpg","path":"uploads/Matterhorn1498376403940.jpg"},{"name":"Matterhorn1498376405409.jpg","path":"uploads/Matterhorn1498376405409.jpg"},{"name":"Matterhorn1498376405957.jpg","path":"uploads/Matterhorn1498376405957.jpg"},{"name":"Matterhorn1498376406130.jpg","path":"uploads/Matterhorn1498376406130.jpg"},{"name":"Matterhorn1498376406384.jpg","path":"uploads/Matterhorn1498376406384.jpg"},{"name":"Matterhorn1498376406508.jpg","path":"uploads/Matterhorn1498376406508.jpg"}]},{"title":"The White Rabbit","description":"The White Rabbit took Auckland's first water front pub and transformed it into an all day eatery with a feminine slant. The concept was of a space that felt like sitting in a friend’s living room - a space that is comfortable for breakfast, sipping on coffee, and also relaxing with a wine in the late afternoon. The fit out provides comfort from breakfast through to lunch and into the dinner service. The White Rabbit immediately jumped onto Metro Magazine’s Top 50 Restaurants list.","photos":[{"name":"The White Rabbit1496899468628.jpg","path":"uploads/The White Rabbit1496899468628.jpg"},{"name":"The White Rabbit1496899470844.jpg","path":"uploads/The White Rabbit1496899470844.jpg"},{"name":"The White Rabbit1496899471292.jpg","path":"uploads/The White Rabbit1496899471292.jpg"},{"name":"The White Rabbit1496899471480.jpg","path":"uploads/The White Rabbit1496899471480.jpg"}]},{"title":"Garden Wholefoods Eatery","description":"A simple design here reflected the down to earth aspects of the clients offering. A full package was created which included branding to capture the hand crafted and sustainable nature of the business. Designed to invoke the feeling of being in a friends backyard courtyard while he or she hosts you to a selection of lovingly crafted foods and hand picked music playing in the background. As the sun goes over head it ultimately spills into the space through plant life as the day closes in.","photos":[{"name":"Garden1496900580713.jpg","path":"uploads/Garden1496900580713.jpg"},{"name":"Garden1496900583150.jpg","path":"uploads/Garden1496900583150.jpg"},{"name":"Garden1496900583568.jpg","path":"uploads/Garden1496900583568.jpg"},{"name":"Garden1496900583658.jpg","path":"uploads/Garden1496900583658.jpg"}]},{"title":"Shaky Isles","description":"The domestic terminal kiosk was an opportunity to produce a custom designed Shaky Isles for\r\nthe Auckland International terminal with a blank canvas as a starting point.\r\n\r\nFunction and human factors such as ergonomics and comfort for staff were highly important factors for the design. The offering is subtly split to communicate both a café offering and bar offering. The Shaky Isles brand is strengthened by enforcing key brand elements like the roundel and crisp controlled white corian counter, offset by shed like timber panels. \r\n\r\nIt won the AIAL’s Retail Excellence award for the year it was created (the runner up to this award, the Shaky Isles Café in the International Terminal was also designed by Richard Keddell Studio)","photos":[{"name":"Shaky Isles1496900349658.jpg","path":"uploads/Shaky Isles1496900349658.jpg"},{"name":"Shaky Isles1496900351935.jpg","path":"uploads/Shaky Isles1496900351935.jpg"},{"name":"Shaky Isles1496900352566.jpg","path":"uploads/Shaky Isles1496900352566.jpg"},{"name":"Shaky Isles1496900352830.jpg","path":"uploads/Shaky Isles1496900352830.jpg"},{"name":"Shaky Isles1496900352889.jpg","path":"uploads/Shaky Isles1496900352889.jpg"}]}]}
